NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/serial/src/serial_handler_mesh.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "serial_handler_mesh.h"
#include "serial_handler_common.h"
#include "serial.h"
#include "serial_status.h"
#include "serial_cmd_rsp.h"
#include "nrf_mesh.h"
#include "device_state_manager.h"
#include "access.h"
#include "net_state.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh_utils.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_externs.h"
#include "config_server.h"
#include "hal.h"
#include "mesh_stack.h"

/* Ensure that we're mapping the size of the serial parameter to the
 * dsm_handle_t. If this triggers, someone changed the size of the
 * dsm_handle_t. In that case, all handle-parameters in the mesh serial
 * commands must change types. */
NRF_MESH_STATIC_ASSERT(sizeof(uint16_t) == sizeof(dsm_handle_t));

/*****************************************************************************
* Local typedefs
*****************************************************************************/
typedef void (*mesh_serial_cmd_handler_cb_t)(const serial_packet_t* p_cmd);
typedef struct
{
    uint8_t opcode;
    uint8_t min_param_length;
    uint8_t optional_extra_bytes; /**< Extra bytes allowed, in addition to min_param_length. */
    mesh_serial_cmd_handler_cb_t handler_cb;
} mesh_serial_cmd_handler_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
static nrf_mesh_evt_handler_t m_evt_handler;

/*****************************************************************************
* Command handler functions
*****************************************************************************/

static void handle_cmd_enable(const serial_packet_t * p_cmd)
{
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, nrf_mesh_enable(), NULL, 0);
}

static void handle_cmd_disable(const serial_packet_t * p_cmd)
{
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, nrf_mesh_disable(), NULL, 0);
}

static void handle_cmd_subnet_add(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_subnet_t rsp;
    dsm_handle_t subnet_handle;
    uint32_t status = dsm_subnet_add(p_cmd->payload.cmd.mesh.subnet_add.net_key_index,
            p_cmd->payload.cmd.mesh.subnet_add.key,
            &subnet_handle);
    rsp.subnet_handle = subnet_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_subnet_update(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_subnet_update(p_cmd->payload.cmd.mesh.subnet_update.subnet_handle,
            p_cmd->payload.cmd.mesh.subnet_update.key);
    serial_evt_cmd_rsp_data_subnet_t rsp;
    rsp.subnet_handle = p_cmd->payload.cmd.mesh.subnet_update.subnet_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_subnet_delete(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_subnet_delete(p_cmd->payload.cmd.mesh.subnet_delete.subnet_handle);
    serial_evt_cmd_rsp_data_subnet_t rsp;
    rsp.subnet_handle = p_cmd->payload.cmd.mesh.subnet_delete.subnet_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_subnet_get_all(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_subnet_list_t rsp;
    uint16_t subnet_key_index[sizeof(rsp.subnet_key_index)];
    uint32_t count = ARRAY_SIZE(rsp.subnet_key_index);
    /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
       may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
       9-2019-q4-major. */
    uint32_t status = dsm_subnet_get_all(subnet_key_index, &count);
    if (count == 0)
    {
        serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
    }
    else
    {
        memcpy((uint16_t *) rsp.subnet_key_index, (uint16_t *) subnet_key_index, sizeof(uint16_t) * count);
        serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(uint16_t) * count);
    }
}

static void handle_cmd_subnet_count_max_get(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_list_size_t rsp;
    rsp.list_size = DSM_SUBNET_MAX;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

