NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/serial/src/serial_handler_mesh.c
static void handle_cmd_addr_subscription_add_virtual(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_subscription_virtual_add(p_cmd->payload.cmd.mesh.addr_subscription_add_virtual.uuid, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_subscription_remove(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_address_subscription_remove(p_cmd->payload.cmd.mesh.addr_subscription_remove.address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = p_cmd->payload.cmd.mesh.addr_subscription_remove.address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_add(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_publish_add(p_cmd->payload.cmd.mesh.addr_publication_add.address, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_add_virtual(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_publish_virtual_add(p_cmd->payload.cmd.mesh.addr_publication_add_virtual.uuid, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_remove(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_address_publish_remove(p_cmd->payload.cmd.mesh.addr_publication_remove.address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = p_cmd->payload.cmd.mesh.addr_publication_remove.address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_packet_send(const serial_packet_t * p_cmd)
{
    nrf_mesh_tx_params_t tx_params;
    memset(&tx_params, 0, sizeof(tx_params));

    serial_evt_cmd_rsp_data_packet_send_t rsp;
    rsp.token = nrf_mesh_unique_token_get();

    uint32_t status = dsm_address_get(p_cmd->payload.cmd.mesh.packet_send.dst_addr_handle, &tx_params.dst);
    if (status == NRF_SUCCESS)
    {
        dsm_local_unicast_address_t valid_src_addrs;
        dsm_local_unicast_addresses_get(&valid_src_addrs);

        if (p_cmd->payload.cmd.mesh.packet_send.src_addr <  valid_src_addrs.address_start ||
            p_cmd->payload.cmd.mesh.packet_send.src_addr >= valid_src_addrs.address_start + valid_src_addrs.count)
        {
            status = NRF_ERROR_INVALID_ADDR;
        }
        else
        {
#if MESH_FEATURE_LPN_ENABLED
            status = NRF_ERROR_NOT_FOUND;
            if (p_cmd->payload.cmd.mesh.packet_send.friendship_credential_flag)
            {
                status = dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, p_cmd->payload.cmd.mesh.packet_send.appkey_handle,
                                                      &tx_params.security_material);
            }

            /* @tagMeshSp section 4.2.2.4:
             *
             * When Publish Friendship Credential Flag is set to 1 and the friendship security material is
             * not available, the master security material shall be used. */
            if (NRF_ERROR_NOT_FOUND == status)
#endif
            {
                status = dsm_tx_secmat_get(DSM_HANDLE_INVALID,
                                           p_cmd->payload.cmd.mesh.packet_send.appkey_handle,
                                           &tx_params.security_material);
            }
            if (status == NRF_SUCCESS)
            {
                tx_params.src       = p_cmd->payload.cmd.mesh.packet_send.src_addr;
                tx_params.ttl       = p_cmd->payload.cmd.mesh.packet_send.ttl;
                tx_params.force_segmented  = p_cmd->payload.cmd.mesh.packet_send.force_segmented;
                tx_params.transmic_size = (nrf_mesh_transmic_size_t) p_cmd->payload.cmd.mesh.packet_send.transmic_size;
                if (p_cmd->length > NRF_MESH_SERIAL_PACKET_OVERHEAD + SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD)
                {
                    tx_params.p_data    = p_cmd->payload.cmd.mesh.packet_send.data;
                    tx_params.data_len  = p_cmd->length - SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD - NRF_MESH_SERIAL_PACKET_OVERHEAD;
                }
                else
                {
                    tx_params.p_data = NULL;
                    tx_params.data_len = 0;
                }
                tx_params.tx_token = rsp.token;

                status = nrf_mesh_packet_send(&tx_params, NULL);
            }
        }
    }
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_clear(const serial_packet_t * p_cmd)
{
    mesh_stack_config_clear();
    serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_SUCCESS, NULL, 0);
}

static void handle_config_devkey_bind(const serial_packet_t * p_cmd)
{
    uint32_t status = config_server_bind(p_cmd->payload.cmd.mesh.config_server_devkey_bind.address_handle);
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
}


/*****************************************************************************
* Static functions
*****************************************************************************/
/**
 * Opcode-handler and -length lookup table.
 */
static const mesh_serial_cmd_handler_t m_handlers[] =
{
    {SERIAL_OPCODE_CMD_MESH_ENABLE,                         0,                                                       0,  handle_cmd_enable},
    {SERIAL_OPCODE_CMD_MESH_DISABLE,                        0,                                                       0,  handle_cmd_disable},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_ADD,                     sizeof(serial_cmd_mesh_subnet_add_t),                    0,  handle_cmd_subnet_add},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_UPDATE,                  sizeof(serial_cmd_mesh_subnet_update_t),                 0,  handle_cmd_subnet_update},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_DELETE,                  sizeof(serial_cmd_mesh_subnet_delete_t),                 0,  handle_cmd_subnet_delete},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_GET_ALL,                 0,                                                       0,  handle_cmd_subnet_get_all},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_subnet_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_ADD,                     sizeof(serial_cmd_mesh_appkey_add_t),                    0,  handle_cmd_appkey_add},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_UPDATE,                  sizeof(serial_cmd_mesh_appkey_update_t),                 0,  handle_cmd_appkey_update},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_DELETE,                  sizeof(serial_cmd_mesh_appkey_delete_t),                 0,  handle_cmd_appkey_delete},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_GET_ALL,                 sizeof(serial_cmd_mesh_appkey_get_all_t),                0,  handle_cmd_appkey_get_all},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_appkey_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_ADD,                     sizeof(serial_cmd_mesh_devkey_add_t),                    0,  handle_cmd_devkey_add},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_DELETE,                  sizeof(serial_cmd_mesh_devkey_delete_t),                 0,  handle_cmd_devkey_delete},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_devkey_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_SET,         sizeof(serial_cmd_mesh_addr_local_unicast_set_t),        0,  handle_cmd_addr_local_unicast_set},
    {SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_GET,         0,                                                       0,  handle_cmd_addr_local_unicast_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD,          sizeof(serial_cmd_mesh_addr_subscription_add_t),         0,  handle_cmd_addr_subscription_add},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD_VIRTUAL,  sizeof(serial_cmd_mesh_addr_subscription_add_virtual_t), 0,  handle_cmd_addr_subscription_add_virtual},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_REMOVE,       sizeof(serial_cmd_mesh_addr_subscription_remove_t),      0,  handle_cmd_addr_subscription_remove},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD,           sizeof(serial_cmd_mesh_addr_publication_add_t),          0,  handle_cmd_addr_publication_add},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD_VIRTUAL,   sizeof(serial_cmd_mesh_addr_publication_add_virtual_t),  0,  handle_cmd_addr_publication_add_virtual},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_REMOVE,        sizeof(serial_cmd_mesh_addr_publication_remove_t),       0,  handle_cmd_addr_publication_remove},
    {SERIAL_OPCODE_CMD_MESH_ADDR_GET,                       sizeof(serial_cmd_mesh_addr_get_t),                      0,  handle_cmd_addr_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_GET_ALL,                   0,                                                       0,  handle_cmd_addr_get_all},
    {SERIAL_OPCODE_CMD_MESH_ADDR_NONVIRTUAL_COUNT_MAX_GET,  0,                                                       0,  handle_cmd_addr_nonvirtual_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_VIRTUAL_COUNT_MAX_GET,     0,                                                       0,  handle_cmd_addr_virtual_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_PACKET_SEND, SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD, sizeof(serial_cmd_mesh_packet_send_t) - SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD,  handle_cmd_packet_send},
    {SERIAL_OPCODE_CMD_MESH_STATE_CLEAR,                    0,                                                       0,  handle_cmd_clear},
    {SERIAL_OPCODE_CMD_MESH_CONFIG_SERVER_BIND,             sizeof(serial_cmd_mesh_config_server_devkey_bind_t),     0,  handle_config_devkey_bind}
};

static void serial_handler_mesh_evt_handle(const nrf_mesh_evt_t* p_evt)
{
    static serial_packet_t * p_serial_evt;
    uint32_t status;
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_MESSAGE_RECEIVED:
        {
            uint32_t data_length = p_evt->params.message.length;

            if (data_length > SERIAL_EVT_MESH_MESSAGE_RECEIVED_DATA_MAXLEN)
            {
                data_length = SERIAL_EVT_MESH_MESSAGE_RECEIVED_DATA_MAXLEN;
            }
            status = serial_packet_buffer_get(data_length + SERIAL_EVT_MESH_MESSAGE_RECEIVED_LEN_OVERHEAD, &p_serial_evt);
            if (status != NRF_SUCCESS)
            {
                break;
            }

            serial_evt_mesh_message_received_t * p_msg_rcvd = &p_serial_evt->payload.evt.mesh.message_received;
            p_msg_rcvd->actual_length = p_evt->params.message.length;
            if (p_evt->params.message.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_UNICAST;
                p_msg_rcvd->dst = p_evt->params.message.dst.value;
            }
            else
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_SUBSCRIPTION;
                dsm_handle_t dst;
                /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
                   may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
                   9-2019-q4-major. */
                NRF_MESH_ASSERT(NRF_SUCCESS == dsm_address_handle_get(&p_evt->params.message.dst, &dst));
                p_msg_rcvd->dst = (uint16_t) dst;
            }
            p_msg_rcvd->src = p_evt->params.message.src.value;
            p_msg_rcvd->appkey_handle = dsm_appkey_handle_get(p_evt->params.message.secmat.p_app);
            p_msg_rcvd->subnet_handle = dsm_subnet_handle_get(p_evt->params.message.secmat.p_net);
            p_msg_rcvd->ttl = p_evt->params.message.ttl;
            p_msg_rcvd->adv_addr_type = p_evt->params.message.p_metadata->params.scanner.adv_addr.addr_type;
            memcpy(p_msg_rcvd->adv_addr, p_evt->params.message.p_metadata->params.scanner.adv_addr.addr, BLE_GAP_ADDR_LEN);
            p_msg_rcvd->rssi = p_evt->params.message.p_metadata->params.scanner.rssi;

            if (data_length > 0)
            {
                memcpy(p_msg_rcvd->data,
                        p_evt->params.message.p_buffer,
                        data_length);
            }
            serial_tx(p_serial_evt);
            break;
        }
        case NRF_MESH_EVT_IV_UPDATE_NOTIFICATION:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_iv_update_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_IV_UPDATE_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.iv_update.iv_index = p_evt->params.iv_update.iv_index;
                serial_tx(p_serial_evt);
            }
            break;

